{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "view_invoice",
    "1": "list_invoices",
    "2": "create_invoice",
    "3": "edit_invoice",
    "4": "list_customers",
    "5": "list_products",
    "6": "show_reports",
    "7": "overdue_invoices",
    "8": "help",
    "9": "create_product_with_data",
    "10": "create_customer_with_data",
    "11": "create_invoice_with_data"
  },
  "initializer_range": 0.02,
  "label2id": {
    "create_customer_with_data": 10,
    "create_invoice": 2,
    "create_invoice_with_data": 11,
    "create_product_with_data": 9,
    "edit_invoice": 3,
    "help": 8,
    "list_customers": 4,
    "list_invoices": 1,
    "list_products": 5,
    "overdue_invoices": 7,
    "show_reports": 6,
    "view_invoice": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.53.3",
  "vocab_size": 30522
}
